# IFCGenericImportWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..IFCGenericImportWarning Property
BuiltInFailures..::..ImportFailures Class See Also
---
The following problems were encountered in the IFC file: [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IFCGenericImportWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IFCGenericImportWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IFCGenericImportWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace